<a href="https://colab.research.google.com/github/Tclack88/pandas_exercises/blob/master/05_Merge/Auto_MPG/Exercises.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# MPG Cars

### Introduction:

The following exercise utilizes data from [UC Irvine Machine Learning Repository](https://archive.ics.uci.edu/ml/datasets/Auto+MPG)

### Step 1. Import the necessary libraries

In [0]:
import pandas as pd
import random

### Step 2. Import the first dataset [cars1](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv) and [cars2](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv).

In [0]:
cars1 = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv")
cars2 = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv")

   ### Step 3. Assign each to a variable called cars1 and cars2

In [4]:
cars1.head()

    mpg  cylinders  displacement  ... Unnamed: 11  Unnamed: 12  Unnamed: 13
0  18.0          8           307  ...         NaN          NaN          NaN
1  15.0          8           350  ...         NaN          NaN          NaN
2  18.0          8           318  ...         NaN          NaN          NaN
3  16.0          8           304  ...         NaN          NaN          NaN
4  17.0          8           302  ...         NaN          NaN          NaN

[5 rows x 14 columns]

In [5]:
cars2.head()

    mpg  cylinders  displacement  ... model  origin                 car
0  33.0          4            91  ...    76       3         honda civic
1  20.0          6           225  ...    76       1      dodge aspen se
2  18.0          6           250  ...    76       1   ford granada ghia
3  18.5          6           250  ...    76       1  pontiac ventura sj
4  17.5          6           258  ...    76       1       amc pacer d/l

[5 rows x 9 columns]

### Step 4. Ops it seems our first dataset has some unnamed blank columns, fix cars1

In [6]:
desired_col_names = list(cars2.columns)
cars1 = cars1[desired_col_names]
cars1.head()

    mpg  cylinders  displacement  ... model  origin                        car
0  18.0          8           307  ...    70       1  chevrolet chevelle malibu
1  15.0          8           350  ...    70       1          buick skylark 320
2  18.0          8           318  ...    70       1         plymouth satellite
3  16.0          8           304  ...    70       1              amc rebel sst
4  17.0          8           302  ...    70       1                ford torino

[5 rows x 9 columns]

### Step 5. What is the number of observations in each dataset?

In [9]:
cars1.shape[1],cars2.shape[1]

(9, 9)

### Step 6. Join cars1 and cars2 into a single DataFrame called cars

In [18]:
cars = pd.merge(cars1,cars2,how='outer')
# Alternatives:
#cars = cars1.append(cars2)
#cars = pd.concat([cars1, cars2])
cars.shape

(398, 9)

### Step 7. Ops there is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [0]:
series = random.sample(range(15000,73000),cars.shape[0])
cars['owners'] = series

### Step 8. Add the column owners to cars

In [24]:
cars.head()

    mpg  cylinders  displacement  ... origin                        car  owners
0  18.0          8           307  ...      1  chevrolet chevelle malibu   17563
1  15.0          8           350  ...      1          buick skylark 320   46230
2  18.0          8           318  ...      1         plymouth satellite   67305
3  16.0          8           304  ...      1              amc rebel sst   68157
4  17.0          8           302  ...      1                ford torino   20846

[5 rows x 10 columns]